package com.example.myapplicationgridviewproject;

import java.io.Serializable;
import java.util.UUID;

public class Person implements Serializable {
    UUID id;
    String name;
    String dateOfName;
    String description;



    Person( String name, String dateOfName, String description)
    {
        this.id = UUID.randomUUID();
        this.name = name;
        this.dateOfName = dateOfName;
        this.description = description;
    }

    public String getName() {
        return name;
    }

    public static Person getItem(UUID id) {
        for (Person item : persons) {
            if (item.id == id) {
                return item;
            }
        }
        return null;
    }

    public static Person persons[] = new Person[]
            {
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\""),
                    new Person("Юлія","07.06","Має дві версії походження. За першою з них, ім'я прийшло до нас із Греції, де слово \"Іулія\" означало \"пухнаста\", \"хвиляста\", \"кучерява\". Друга ж гласить, що ім'я – латинського походження і трактується як \"липнева\" або \"з роду Юліїв\""),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Юлія","07.06","Має дві версії походження. За першою з них, ім'я прийшло до нас із Греції, де слово \"Іулія\" означало \"пухнаста\", \"хвиляста\", \"кучерява\". Друга ж гласить, що ім'я – латинського походження і трактується як \"липнева\" або \"з роду Юліїв\""),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\""),
                    new Person("Юлія","07.06","Має дві версії походження. За першою з них, ім'я прийшло до нас із Греції, де слово \"Іулія\" означало \"пухнаста\", \"хвиляста\", \"кучерява\". Друга ж гласить, що ім'я – латинського походження і трактується як \"липнева\" або \"з роду Юліїв\""),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Юлія","07.06","Має дві версії походження. За першою з них, ім'я прийшло до нас із Греції, де слово \"Іулія\" означало \"пухнаста\", \"хвиляста\", \"кучерява\". Друга ж гласить, що ім'я – латинського походження і трактується як \"липнева\" або \"з роду Юліїв\""),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Ірина","05.04, 30.10","Ім'я Ірина має давньогрецьке походження. Найімовірніше, воно походить від імені \"Eirene\" (Ейрена), що належало давньогрецькій богині миру і спокою. Буквальне трактування значення цього імені звучить як \"мир і спокій\"."),
                    new Person("Дмитро","12.12, 20.05, 13.09","Це давньогрецьке ім'я, яке означає\" присвячений богині Деметрі\" - богині родючості і землі. Ще одне значення імені - \"хлібороб\"."),
                    new Person("Юлія","07.06","Має дві версії походження. За першою з них, ім'я прийшло до нас із Греції, де слово \"Іулія\" означало \"пухнаста\", \"хвиляста\", \"кучерява\". Друга ж гласить, що ім'я – латинського походження і трактується як \"липнева\" або \"з роду Юліїв\""),
            };
}
